In [2]:
## https://chrisalbon.com/python/basics/strings_to_datetime/
#Step 1:
#Write a program to download stock data by calling this URL and save it inside a pandas dataframe
#https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=MSFT&apikey=8WAC2EQWT6CHVMKY&datatype=csv

## Step2:
#Filter the dataframe to contain only the rows where the open price is highest open price during that week. 
#A week is defined as Monday - Friday

Save this filtered dataframe to an output file.
import pandas as pd

df =  pd.read_csv("https://www.alphavantage.co/query?function=TIME_SERIES_DAILY&symbol=MSFT&apikey=8WAC2EQWT6CHVMKY&datatype=csv")

In [3]:
df.head()

    timestamp    open     high    low  close    volume
0  2018-02-21  92.980  93.3595  91.49  91.49  26663828
1  2018-02-20  91.475  93.0600  91.01  92.72  30107057
2  2018-02-16  92.450  93.5000  91.80  92.00  30188535
3  2018-02-15  91.210  92.7200  90.62  92.66  27407914
4  2018-02-14  88.510  90.9900  88.41  90.81  34314101

In [13]:
df.shape

(100, 6)

In [14]:
df.dtypes

timestamp     object
open         float64
high         float64
low          float64
close        float64
volume         int64
dtype: object

In [18]:
df['datetime'] = pd.to_datetime(df.timestamp)

In [19]:
df.head()

    timestamp    open     high    low  close    volume   datetime
0  2018-02-21  92.980  93.3595  91.49  91.49  26663828 2018-02-21
1  2018-02-20  91.475  93.0600  91.01  92.72  30107057 2018-02-20
2  2018-02-16  92.450  93.5000  91.80  92.00  30188535 2018-02-16
3  2018-02-15  91.210  92.7200  90.62  92.66  27407914 2018-02-15
4  2018-02-14  88.510  90.9900  88.41  90.81  34314101 2018-02-14

In [20]:
df.dtypes

timestamp            object
open                float64
high                float64
low                 float64
close               float64
volume                int64
datetime     datetime64[ns]
dtype: object

In [22]:
df.drop('datetime',axis=1,inplace=True)

In [23]:
df.head()

    timestamp    open     high    low  close    volume
0  2018-02-21  92.980  93.3595  91.49  91.49  26663828
1  2018-02-20  91.475  93.0600  91.01  92.72  30107057
2  2018-02-16  92.450  93.5000  91.80  92.00  30188535
3  2018-02-15  91.210  92.7200  90.62  92.66  27407914
4  2018-02-14  88.510  90.9900  88.41  90.81  34314101

In [24]:
df['timestamp'] = pd.to_datetime(df.timestamp)

In [25]:
df.head()

   timestamp    open     high    low  close    volume
0 2018-02-21  92.980  93.3595  91.49  91.49  26663828
1 2018-02-20  91.475  93.0600  91.01  92.72  30107057
2 2018-02-16  92.450  93.5000  91.80  92.00  30188535
3 2018-02-15  91.210  92.7200  90.62  92.66  27407914
4 2018-02-14  88.510  90.9900  88.41  90.81  34314101

In [26]:
df.dtypes

timestamp    datetime64[ns]
open                float64
high                float64
low                 float64
close               float64
volume                int64
dtype: object

In [29]:
col1 = df.iloc[:,0]

In [31]:
df['weekOfYear'] = df['timestamp'].dt.weekofyear

In [32]:
df.head()

   timestamp    open     high    low  close    volume  weekOfYear
0 2018-02-21  92.980  93.3595  91.49  91.49  26663828           8
1 2018-02-20  91.475  93.0600  91.01  92.72  30107057           8
2 2018-02-16  92.450  93.5000  91.80  92.00  30188535           7
3 2018-02-15  91.210  92.7200  90.62  92.66  27407914           7
4 2018-02-14  88.510  90.9900  88.41  90.81  34314101           7

In [33]:
## http://hamelg.blogspot.in/2015/11/python-for-data-analysis-part-17.html
df['year'] = df['timestamp'].dt.year
df['month'] = df['timestamp'].dt.month

In [34]:
df.head()

   timestamp    open     high    low  close    volume  weekOfYear  year  month
0 2018-02-21  92.980  93.3595  91.49  91.49  26663828           8  2018      2
1 2018-02-20  91.475  93.0600  91.01  92.72  30107057           8  2018      2
2 2018-02-16  92.450  93.5000  91.80  92.00  30188535           7  2018      2
3 2018-02-15  91.210  92.7200  90.62  92.66  27407914           7  2018      2
4 2018-02-14  88.510  90.9900  88.41  90.81  34314101           7  2018      2

In [39]:
dfmaxOpen = df.groupby("weekOfYear").max()['open']

In [40]:
dfmaxOpen

weekOfYear
1     87.66
2     88.67
3     90.14
4     93.12
5     95.14
6     90.56
7     92.45
8     92.98
39    73.94
40    75.67
41    77.59
42    78.32
43    84.37
44    84.36
45    84.77
46    83.66
47    83.83
48    84.71
49    84.42
50    85.74
51    87.12
52    85.90
Name: open, dtype: float64

In [ ]:
##  http://hamelg.blogspot.in/2015/11/python-for-data-analysis-part-18.html